app/controllers/posts_controller.rb

  def users
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @post = Post.find( title: params[:title], content: params[:blog], user_id: current_user.id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]