app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
---
  def users
    @users = User.all

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @users = User.all