app/controllers/sessions_controller.rb

  def create
      puts '**********************'
      puts params.inspect
      puts '**********************'
      # Find a user in the database that matches the username in the form.
      @user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ForeverAutumn"], ["LIMIT", 1]]