app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if session[:user_id]
        @current_user = User.find(session[:user_id])

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "DarkKnight"], ["email", "billionair_hero@gotham.com"], ["password", "gotham"], ["created_at", "2018-04-15 20:21:38.614898"], ["updated_at", "2018-04-15 20:21:38.614898"]]
INSERT INTO "posts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2018-04-18 14:09:50.414024"], ["updated_at", "2018-04-18 14:09:50.414024"]]
---
  def posts
    @users = User.all
    @user = current_user
    @posts = @user.posts
    @newpost = Post.create( title: params[:title], content: params[:blog], user_id: current_user.id)

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-04-13 14:25:43.208840"], ["updated_at", "2018-04-13 14:25:43.208840"]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def update
      @users = User.all
      @newpost = Post.create( title: params[:title], content: params[:blog], user_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
      @user = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
      User.delete(params[:id])