app/controllers/users_controller.rb

  def home
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
      User.delete(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]